app/controllers/apis_controller.rb

  def transactions
    tranactions = Transaction.all
---
SELECT  "transactions".* FROM "transactions"  ORDER BY "transactions"."id" ASC LIMIT 1

  def top_up
    amount = params["amount"]
    txref = params["txref"] || ""

    p current_user

    bl = CashBalance.find_by(user_id: current_user.id)
    bl.amount += amount.to_f
    bl.save

    t = Transaction.create(txref: txref, t: "top_up", amount: amount, asset: "cash")
---
SELECT  "cash_balances".* FROM "cash_balances" WHERE "cash_balances"."user_id" = 1 LIMIT 1
UPDATE "cash_balances" SET "amount" = ?, "updated_at" = ? WHERE "cash_balances"."id" = ?  [["amount", 505.0], ["updated_at", "2018-04-06 08:51:35.132442"], ["id", 1]]
INSERT INTO "transactions" ("txref", "t", "amount", "asset", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["txref", ""], ["t", "top_up"], ["amount", 500000.0], ["asset", "cash"], ["created_at", "2018-04-06 09:24:24.243631"], ["updated_at", "2018-04-06 09:24:24.243631"]]

  def buy
    rateG2C = 1.0/10

    amount = params["amount"]
    txref = params["txref"] || ""

    bl = CashBalance.find_by(user_id: current_user.id)
    bl.amount -= amount.to_f
    bl.save

    gb = GoldBalance.find_by(user_id: current_user.id)
    gb.amount += amount.to_f * rateG2C
    gb.save

    t = Transaction.create(txref: txref, t: "buy", amount: amount, asset: "gold")
---
SELECT  "gold_balances".* FROM "gold_balances" WHERE "gold_balances"."user_id" = 1 LIMIT 1
UPDATE "cash_balances" SET "amount" = ?, "updated_at" = ? WHERE "cash_balances"."id" = ?  [["amount", 505.0], ["updated_at", "2018-04-06 09:01:05.876370"], ["id", 1]]
INSERT INTO "transactions" ("txref", "t", "amount", "asset", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["txref", ""], ["t", "buy"], ["amount", 5.0], ["asset", "gold"], ["created_at", "2018-04-06 09:25:12.241570"], ["updated_at", "2018-04-06 09:25:12.241570"]]

  def sell
    rateG2C = 1.0/10

    amount = params["amount"]
    txref = params["txref"] || ""

    bl = CashBalance.find_by(user_id: current_user.id)
    bl.amount += amount.to_f
    bl.save

    gb = GoldBalance.find_by(user_id: current_user.id)
    gb.amount -= amount.to_f * rateG2C
    gb.save

    t = Transaction.create(txref: txref, t: "sell", amount: amount, asset: "gold")
---
SELECT  "gold_balances".* FROM "gold_balances" WHERE "gold_balances"."user_id" = 1 LIMIT 1
UPDATE "cash_balances" SET "amount" = ?, "updated_at" = ? WHERE "cash_balances"."id" = ?  [["amount", 505.0], ["updated_at", "2018-04-06 09:02:53.050718"], ["id", 1]]
INSERT INTO "transactions" ("txref", "t", "amount", "asset", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["txref", ""], ["t", "sell"], ["amount", 5.0], ["asset", "gold"], ["created_at", "2018-04-06 09:25:14.367125"], ["updated_at", "2018-04-06 09:25:14.367125"]]

  def balances
    bl = CashBalance.find_by(user_id: current_user.id)
---
SELECT  "gold_balances".* FROM "gold_balances" WHERE "gold_balances"."user_id" = 1 LIMIT 1