app/controllers/cash_balances_controller.rb

  def index
    @cash_balances = CashBalance.all
---
SELECT "cash_balances".* FROM "cash_balances"

  def create
    @cash_balance = CashBalance.new(cash_balance_params)

    respond_to do |format|
      if @cash_balance.save
---
INSERT INTO "cash_balances" ("amount", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 500.0], ["User_id", 1], ["created_at", "2018-04-06 07:58:35.311919"], ["updated_at", "2018-04-06 07:58:35.311919"]]

    def set_cash_balance
      @cash_balance = CashBalance.find(params[:id])
---
SELECT  "cash_balances".* FROM "cash_balances" WHERE "cash_balances"."id" = ? LIMIT 1  [["id", 1]]