app/controllers/gold_balances_controller.rb

SELECT "gold_balances".* FROM "gold_balances"
---
  def index
    @gold_balances = GoldBalance.all

INSERT INTO "gold_balances" ("amount", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 500.0], ["User_id", 0], ["created_at", "2018-04-06 07:53:29.610120"], ["updated_at", "2018-04-06 07:53:29.610120"]]
---
  def create
    @gold_balance = GoldBalance.new(gold_balance_params)

    respond_to do |format|
      if @gold_balance.save

DELETE FROM "gold_balances" WHERE "gold_balances"."id" = ?  [["id", 1]]
---
  def destroy
    @gold_balance.destroy

SELECT  "gold_balances".* FROM "gold_balances" WHERE "gold_balances"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_gold_balance
      @gold_balance = GoldBalance.find(params[:id])