app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

INSERT INTO "transactions" ("txref", "type", "asset", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["txref", "assss"], ["type", ""], ["asset", "gold"], ["amount", 10.0], ["created_at", "2018-04-06 08:03:20.858627"], ["updated_at", "2018-04-06 08:03:20.858627"]]
---
  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save

UPDATE "transactions" SET "type" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["type", "a"], ["updated_at", "2018-04-06 08:04:05.751094"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @transaction.update(transaction_params)

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_transaction
      @transaction = Transaction.find(params[:id])